src/cf/DataProcessors/мрРасчетСреднегоЧекаПоПродавцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>мрРасчетСреднегоЧекаПоПродавцам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБлоковШагаМАП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБлоковШагаШафл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/мрДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>мрДанные</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товар</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/мрСортированныеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>мрСортированныеДанные</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КлючДанных</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/мрРасчетСреднегоЧекаПоПродавцам/Ext/ObjectModule.bsl
Перем СчетчикБлоков;
Перем ВыборкаКлючей;

//Shuffle
Перем СчетчикБлоковСорт;
Перем МассивКлючей;
Перем КоличествоШафл;

#Область ПрограммныйИнтерфейс

Функция ПолучитьСледующийБлокДанных(ВыходныеДанные) Экспорт
	
	Если СчетчикБлоков >= КоличествоБлоковШагаМАП Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РазмерШага = (ДатаОкончания - ДатаНачала) / КоличествоБлоковШагаМАП;
	
	ДатаН = ДатаНачала + СчетчикБлоков * РазмерШага;
	СчетчикБлоков = СчетчикБлоков + 1;
	ДатаК = ДатаНачала + СчетчикБлоков * РазмерШага;
	
	Если КоличествоБлоковШагаМАП = СчетчикБлоков Тогда
		ДатаК = ДатаОкончания;
	КонецЕсли;
	
	Выборка = ПолучитьДанныеИзБазы(ДатаН, ДатаК);
	ВыходныеДанные = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Структура = Новый Структура();
		Структура.Вставить("Регистратор");
		Структура.Вставить("Период");
		Структура.Вставить("Город");
		Структура.Вставить("Товар");
		Структура.Вставить("Количество");
		Структура.Вставить("Цена");
		Структура.Вставить("Сумма");
		ЗаполнитьЗначенияСвойств(Структура, Выборка);
		ВыходныеДанные.Добавить(Структура);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьСледующийБлокСортированныхДанных(ВыходныеДанные) Экспорт
	
	Если МассивКлючей = Неопределено Тогда
		МассивКлючей = ПолучитьКлючи();	
		СчетчикБлоковСорт = 0;
		КоличествоШафл = КоличествоБлоковШагаШафл;
	КонецЕсли;
	
	Если СчетчикБлоковСорт >= КоличествоШафл Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Если КоличествоШафл=0 Тогда
		РазмерБлока = МассивКлючей.Количество();
	ИначеЕсли МассивКлючей.Количество() <= КоличествоШафл Тогда
		РазмерБлока = 1;
		КоличествоШафл = МассивКлючей.Количество();
	Иначе
		РазмерБлока = ЦЕЛ(МассивКлючей.Количество() / КоличествоШафл);
	КонецЕсли;
	
	Начало = РазмерБлока * СчетчикБлоковСорт;
	СчетчикБлоковСорт = СчетчикБлоковСорт + 1;
	Конец = РазмерБлока * СчетчикБлоковСорт;
	Конец = МИН(Конец, МассивКлючей.Количество());
	
	Если СчетчикБлоковСорт = КоличествоШафл Тогда
		Конец = МассивКлючей.Количество();	
	КонецЕсли;
	
	КлючиДляВыборки = Новый Массив;
	Для сч = Начало По Конец-1 Цикл
		КлючиДляВыборки.Добавить(МассивКлючей.Получить(сч));
	КонецЦикла;
	
	ВыходныеДанные = Новый Массив;
	Выборка = ПолучитьВыборкуДанныхПоКлючам(КлючиДляВыборки);
	
	Пока Выборка.Следующий() Цикл
		Структура = Новый Структура();
		Структура.Вставить("Ключ");
		Структура.Вставить("Количество");
		Структура.Вставить("Сумма");
		ЗаполнитьЗначенияСвойств(Структура, Выборка);
		ВыходныеДанные.Добавить(Структура);
	КонецЦикла;
	
	Возврат Истина;
		
КонецФункции

#КонецОбласти

#Область Служебные

Функция ПолучитьДанныеИзБазы(ДатаН, ДатаК)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	мрДанные.Регистратор КАК Регистратор,
	|	мрДанные.Период КАК Период,
	|	мрДанные.Город КАК Город,
	|	мрДанные.Товар КАК Товар,
	|	мрДанные.Количество КАК Количество,
	|	мрДанные.Цена КАК Цена,
	|	мрДанные.Сумма КАК Сумма
	|ИЗ
	|	РегистрСведений.мрДанные КАК мрДанные
	|ГДЕ
	|	мрДанные.Период МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаН);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаК);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выбрать();
		
КонецФункции

Функция ПолучитьКлючи()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мрСортированныеДанные.Ключ КАК Ключ
		|ИЗ
		|	Справочник.мрСортированныеДанные КАК мрСортированныеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	мрСортированныеДанные.Ключ";
	
	РезультатЗапроса = Запрос.Выполнить();	

	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ключ");
	
КонецФункции

Функция ПолучитьВыборкуДанныхПоКлючам(КлючиДляВыборки)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мрСортированныеДанныеДанные.Сумма КАК Сумма,
		|	мрСортированныеДанныеДанные.Количество КАК Количество,
		|	мрСортированныеДанныеДанные.Ссылка КАК Ключ
		|ИЗ
		|	Справочник.мрСортированныеДанные.Данные КАК мрСортированныеДанныеДанные
		|ГДЕ
		|	мрСортированныеДанныеДанные.Ссылка.Ключ В(&КлючиДляВыборки)";
	
	Запрос.УстановитьПараметр("КлючиДляВыборки", КлючиДляВыборки);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции

#КонецОбласти

СчетчикБлоков = 0;
